package com.a;

public class a {
    public static void main(String[] args) {
        //进程就是一个程序的执行过程，即一个正在执行的程序
        //线程就是进程中的一个执行单元，由进程创建，是进程的的一个实体
        //一个进程中至少有一个线程
        //一个线程中至少有一个程序
        //一个进程中可以有多个线程
        //一个线程中可以有多个程序
        //故而：一个进程中可以有多个线程，每个线程中可以有多个程序
        //多线程：同一时刻多个线程同时执行，比如一个qq进程可以同时打开多个聊天窗口，百度网盘进程可以同时下载多个文件。
        //并发：同一时刻多个任务交替执行，单核cpu实现的多任务就是并发
        //并行：同一时刻多个任务同时执行，同一时刻多个任务同时进行，多核cpu实现的多任务就是并行
        //并发并行可以同时进行
        /**
        //线程的创建方式：1.继承Thread类 2.实现Runnable接口 3.实现Callable接口
        //线程的启动方式：start()方法
        //线程的停止方式：stop()方法
        //线程的暂停方式：sleep()方法
        //线程的恢复方式：resume()方法
        //线程的继续方式：yield()方法
        //线程的优先级方式：setPriority()方法
        //线程的优先级方式：getPriority()方法
         */

    }
}
